Revit 2027 API
Entity(Schema) Constructor
 Creates a new Entity corresponding to the Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Entity(
	Schema schema
)
Public Sub New (
	schema As Schema
)
public:
Entity(
	Schema^ schema
)
new :
        schema : Schema -> Entity
Parameters
schema Schema
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Writing of Entities of this Schema is not allowed to the current add-in.
Remarks
 You can store the newly created Entity in an Element or in another Entity. If you do not have write access to the Schema, an exception will be thrown.
See Also
Reference
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace